[
  {
    "id": 1,
    "skill": "React.js + Tailwind",
    "impacto": "En el desarrollo de mi portfolio y proyectos universitarios.",
    "accion": "Construí interfaces modernas, responsive y accesibles con React y Tailwind.",
    "resultado": "Mejoré la experiencia del usuario final y reforcé la presentación de mis proyectos."
  },
  {
    "id": 2,
    "skill": "Node.js + Express",
    "impacto": "En proyectos académicos y personales de backend.",
    "accion": "Desarrollé APIs RESTful con autenticación JWT y middleware personalizados.",
    "resultado": "Logré servicios seguros y escalables, integrados con frontend en tiempo real."
  },
  {
    "id": 3,
    "skill": "PostgreSQL y MongoDB",
    "impacto": "En proyectos universitarios y personales.",
    "accion": "Diseñé modelos de datos eficientes y apliqué consultas optimizadas.",
    "resultado": "Reduje tiempos de respuesta y aseguré persistencia confiable para aplicaciones web."
  },
  {
    "id": 4,
    "skill": "Docker",
    "impacto": "En despliegues de proyectos personales.",
    "accion": "Creé contenedores para backend y base de datos.",
    "resultado": "Aseguré portabilidad y facilidad de despliegue en distintos entornos."
  },
  {
    "id": 5,
    "skill": "Git y GitHub",
    "impacto": "En proyectos colaborativos como Wei-Little (11 contribuidores).",
    "accion": "Gestioné ramas, pull requests y revisiones de código.",
    "resultado": "Mantuvimos un flujo de trabajo ordenado y colaborativo, reduciendo conflictos."
  },
  {
    "id": 6,
    "skill": "Testing (Jest y Cypress)",
    "impacto": "En pruebas E2E de mi aplicación ParkIT.",
    "accion": "Automatizé casos de login, búsqueda y reserva de parking.",
    "resultado": "Aumenté la confiabilidad del sistema y detecté errores antes del despliegue."
  },
  {
    "id": 7,
    "skill": "Scrum y Agile",
    "impacto": "Como Scrum Master en proyectos académicos.",
    "accion": "Facilité ceremonias ágiles y gestioné el backlog con Trello y Jira.",
    "resultado": "El equipo mantuvo el ritmo de entrega y mejoró la coordinación."
  }
]
