[
  {
    "id": 1,
    "skill": "Liderazgo en proyectos pequeños",
    "impacto": "Durante proyectos académicos (p. ej., Wei-Little).",
    "accion": "Coordiné responsabilidades, desatasqué bloqueos técnicos y mantuve la alineación del equipo.",
    "resultado": "Entregamos una demo funcional de calidad dentro del plazo y con buena valoración."
  },
  {
  "id": 2,
  "skill": "Trabajo en equipo",
  "impacto": "En proyectos colaborativos como ParkIT.",
  "accion": "Colaboré estrechamente con mis compañeros en la integración entre backend y frontend, compartiendo buenas prácticas y resolviendo dudas técnicas.",
  "resultado": "El equipo consiguió entregar una aplicación completa, estable y funcional, destacada por la integración fluida de sus diferentes módulos."
  },
  {
    "id": 3,
    "skill": "Resolución de problemas",
    "impacto": "Durante el desarrollo de ParkIT.",
    "accion": "Identifiqué posibles mejoras en la comunicación en tiempo real e implementé WebSockets con STOMP.",
    "resultado": "Mejoró la UX con notificaciones instantáneas y chat en tiempo real."
  },
  {
    "id": 4,
    "skill": "Adaptabilidad y aprendizaje continuo",
    "impacto": "Al adoptar nuevas tecnologías de frontend.",
    "accion": "Aprendí React y Tailwind CSS de forma autodidacta y los apliqué directamente en producción.",
    "resultado": "Construí este portfolio moderno, responsive y optimizado, demostrando aprendizaje rápido."
  },
  {
  "id": 5,
  "skill": "Comunicación efectiva",
  "impacto": "En presentaciones de proyectos y en la coordinación con compañeros de distintas áreas.",
  "accion": "Traducí conceptos técnicos complejos en explicaciones claras.",
  "resultado": "Logré que comprendieran mejor el proyecto, tarea u objetivo, mejorando la colaboración y la toma de decisiones."
},
{
  "id": 6,
  "skill": "Gestión del tiempo",
  "impacto": "Compaginando universidad, proyectos personales, trabajo y vida personal.",
  "accion": "Planifiqué mis tareas diarias y semanales utilizando herramientas como Trello y Google Calendar.",
  "resultado": "Cumplí con mis responsabilidades de manera efectiva."
},
{
  "id": 7,
    "skill": "Pensamiento crítico",
    "impacto": "Al diseñar el modelo de dominio de ParkIT o Wei-Little.",
    "accion": "Evalué alternativas de diseño (normalización, modelado relacional) considerando escalabilidad y complejidad.",
    "resultado": "Seleccioné la solución más adecuada, mejorando rendimiento y mantenibilidad."
  },
  {
    "id": 8,
    "skill": "Proactividad",
    "impacto": "En la construcción de mi portfolio personal.",
    "accion": "Fui más allá de lo básico: añadí animaciones y carruseles dentro de cards con buen UX.",
    "resultado": "Creé un portfolio diferencial que refleja capacidades técnicas y sentido estético."
  },
  {
    "id": 9,
    "skill": "Resiliencia",
    "impacto": "Compatibilizando universidad, proyectos y trabajo",
    "accion": "Priorizaba tareas y mantenía una actitud positiva y el foco en mis objetivos.",
    "resultado": "Logré adaptarme a situaciones adversas y cumplir poco a poco los objetivos que me iba marcando."
  }
]
