[
  {
    "id": 1,
    "skill": "Liderazgo en proyectos pequeños",
    "impacto": "En un proyecto académico como Scrum Master.",
    "accion": "Organicé las reuniones diarias, facilité la resolución de conflictos y motivé al equipo a mantener el ritmo de trabajo.",
    "resultado": "El equipo alcanzó los objetivos de cada sprint, logrando entregar un proyecto estable y dentro de los plazos."
  },
  {
    "id": 2,
    "skill": "Comunicación efectiva",
    "impacto": "Trabajando como Finance Assistant en el sector logístico.",
    "accion": "Expliqué informes financieros y conciliaciones a compañeros sin background contable.",
    "resultado": "Facilité la toma de decisiones rápidas y mejoré la coordinación entre departamentos."
  },
  {
    "id": 3,
    "skill": "Resolución de problemas",
    "impacto": "Durante el desarrollo del proyecto ParkIT en la universidad.",
    "accion": "Detecté limitaciones técnicas en la comunicación entre usuarios y empresas e implementé WebSockets para solucionarlo.",
    "resultado": "Mejoré la experiencia de usuario ofreciendo notificaciones en tiempo real y un chat interactivo."
  },
  {
    "id": 4,
    "skill": "Trabajo en equipo",
    "impacto": "Como bartender en la industria de la hostelería nocturna.",
    "accion": "Colaboré estrechamente con compañeros para atender a clientes en momentos de máxima demanda.",
    "resultado": "Mantuvimos un servicio ágil y de calidad en un entorno de alta presión."
  },
  {
    "id": 5,
    "skill": "Gestión del tiempo",
    "impacto": "Compaginando estudios de Ingeniería de Software, certificados profesionales y experiencia laboral.",
    "accion": "Priorizaba tareas con herramientas como Trello y GitHub Projects.",
    "resultado": "Cumplí plazos académicos y laborales sin comprometer la calidad del trabajo."
  },
  {
    "id": 6,
    "skill": "Adaptabilidad",
    "impacto": "Cambiando de la logística y finanzas hacia el desarrollo de software.",
    "accion": "Aprendí tecnologías como React y Tailwind de manera autodidacta, aplicándolas directamente en mi portfolio.",
    "resultado": "Construí un portfolio moderno y responsive que refleja versatilidad y capacidad de aprendizaje."
  },
  {
    "id": 7,
    "skill": "Atención al cliente",
    "impacto": "Trabajando como bartender en la industria nocturna.",
    "accion": "Escuchaba a los clientes, resolvía incidencias con rapidez y sugería productos personalizados.",
    "resultado": "Generé experiencias positivas que derivaron en clientes recurrentes y mayor satisfacción."
  },
  {
    "id": 8,
    "skill": "Pensamiento crítico",
    "impacto": "En el diseño del backend del proyecto ParkIT.",
    "accion": "Evalué alternativas tecnológicas entre REST, WebSockets y colas de mensajería.",
    "resultado": "Seleccioné la arquitectura más escalable y eficiente, garantizando rendimiento a largo plazo."
  },
  {
    "id": 9,
    "skill": "Multitasking",
    "impacto": "Trabajando en un bar de alto volumen de clientes.",
    "accion": "Atendía pedidos, cobraba, preparaba bebidas y mantenía la comunicación con el equipo en paralelo.",
    "resultado": "Desarrollé la habilidad de manejar múltiples tareas con precisión y rapidez bajo presión."
  },
  {
    "id": 10,
    "skill": "Proactividad e iniciativa",
    "impacto": "En el desarrollo de mi portfolio personal.",
    "accion": "No me limité a mostrar proyectos básicos: diseñé un laptop interactivo, animaciones y carousels para destacar.",
    "resultado": "Construí un portfolio diferencial que refleja tanto mi capacidad técnica como creatividad."
  }
]
